tutorial/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1.0;

vertices
(
    // Inner square (z = 0)
    (-0.1   0.1   0)       // 0
    (0.1    0.1   0)       // 1
    (0.1   -0.1   0)       // 2
    (-0.1  -0.1   0)       // 3

    // Outer square (z = 0)
    (-0.35355339059  0.35355339059  0)       // 4
    (0.35355339059   0.35355339059  0)       // 5
    (0.35355339059  -0.35355339059  0)       // 6
    (-0.35355339059 -0.35355339059  0)       // 7

    // Inner square (z = 12)
    (-0.1   0.1   0.01)       // 8
    (0.1    0.1   0.01)       // 9
    (0.1   -0.1   0.01)       // 10
    (-0.1  -0.1   0.01)       // 11

    // Outer square (z = 12)
    (-0.35355339059  0.35355339059  0.01)       // 12
    (0.35355339059   0.35355339059  0.01)       // 13
    (0.35355339059  -0.35355339059  0.01)       // 14
    (-0.35355339059 -0.35355339059  0.01)       // 15
);

blocks
(
    hex (0 1 5 4 8 9 13 12) (26 110 1) simpleGrading (1 0.03 1)
    hex (3 0 4 7 11 8 12 15) (26 110 1) simpleGrading (1 0.03 1)
    hex (3 7 6 2 11 15 14 10) (110 26 1) simpleGrading (0.03 1 1)
    hex (2 6 5 1 10 14 13 9) (110 26 1) simpleGrading (0.03 1 1)
    hex (3 2 1 0 11 10 9 8)  (26 26 1) simpleGrading (1 1 1)
);

edges
(
    // Arcs at bottom (z=0)
    arc 4 5 (0      0.49999999999    0)
    arc 5 6 (0.49999999999    0      0)
    arc 6 7 (0     -0.49999999999    0)
    arc 7 4 (-0.49999999999   0      0)

    // Arcs at top (z=12)
    arc 12 13   (0      0.49999999999   0.01)
    arc 13 14  (0.49999999999    0     0.01)
    arc 14 15 (0     -0.49999999999   0.01)
    arc 15 12  (-0.49999999999   0     0.01)
);

boundary
(
    inlet
    {
        type            cyclic;
        neighbourPatch  outlet;
        faces
        (
            (0 1 2 3)
            (0 4 5 1)
            (3 7 4 0)
            (2 6 7 3)
            (1 2 6 5)
        );
    }

    outlet
    {
        type            cyclic;
        neighbourPatch  inlet;
        faces
        (
            (8 9 10 11)
            (8 12 13 9)
            (11 15 12 8)
            (10 14 15 11)
            (9 10 14 13)
        );
    }

    wall
    {
        type            wall;
        faces
        (
            (4 7 15 12)
            (7 6 14 15)
            (6 5 13 14)
            (5 4 12 13)
        );
    }
);


mergePatchPairs ();

