tutorial/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel HerschelBulkley;
HerschelBulkleyCoeffs
{
    nu0      [ 0 2 -1 0 0 0 0 ] 1e-3;
    tau0     [ 0 2 -2 0 0 0 0 ] 8.39492321e-8;
    k        [ 0 2 -1 0 0 0 0 ] 1e-6;
    n        [ 0 0  0 0 0 0 0 ] 1;
}

// ************************************************************************* //
